test/Malle/FSD/noTHM/system/blockMeshDict_burner_refined
/*--------------------------------*- C++ -*----------------------------------*\
  Slot-burner geometry with a 2-level refined/coarse Cartesian mesh.

  Derived from the real burner-lip surface data (surface_les.dat): central
  jet H=8mm, two lip walls ~0.4mm thick (0.0004m, matching the real geometry),
  coflow extending to the full domain half-height, cyclic z-slice Lz=16mm.

  REFINEMENT: a Lx=52mm x Ly=32mm window around the inlet (jet H=8mm + 12mm
  coflow band on each side, i.e. |y|<16mm and x<52mm) is meshed at delta_fine
  = delta_coarse/2. Everywhere else (x>52mm OR |y|>16mm) uses delta_coarse.
  delta_coarse = 1mm here -- TUNE. The two lip bands (0.4mm real thickness)
  cannot fit a whole delta_fine=0.5mm cell without rounding: each gets exactly
  1 cell (local Delta=0.4mm), same unavoidable-thin-band exception used
  earlier in this thread for the original slot-burner DNS mesh.
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 -0.08 -0.008)   // 0
    (0.052 -0.08 -0.008)   // 1
    (0.308 -0.08 -0.008)   // 2
    (0 -0.016 -0.008)   // 3
    (0.052 -0.016 -0.008)   // 4
    (0.308 -0.016 -0.008)   // 5
    (0 -0.0044 -0.008)   // 6
    (0.052 -0.0044 -0.008)   // 7
    (0.308 -0.0044 -0.008)   // 8
    (0 -0.004 -0.008)   // 9
    (0.052 -0.004 -0.008)   // 10
    (0.308 -0.004 -0.008)   // 11
    (0 0.004 -0.008)   // 12
    (0.052 0.004 -0.008)   // 13
    (0.308 0.004 -0.008)   // 14
    (0 0.0044 -0.008)   // 15
    (0.052 0.0044 -0.008)   // 16
    (0.308 0.0044 -0.008)   // 17
    (0 0.016 -0.008)   // 18
    (0.052 0.016 -0.008)   // 19
    (0.308 0.016 -0.008)   // 20
    (0 0.08 -0.008)   // 21
    (0.052 0.08 -0.008)   // 22
    (0.308 0.08 -0.008)   // 23
    (0 -0.08 0.008)   // 24
    (0.052 -0.08 0.008)   // 25
    (0.308 -0.08 0.008)   // 26
    (0 -0.016 0.008)   // 27
    (0.052 -0.016 0.008)   // 28
    (0.308 -0.016 0.008)   // 29
    (0 -0.0044 0.008)   // 30
    (0.052 -0.0044 0.008)   // 31
    (0.308 -0.0044 0.008)   // 32
    (0 -0.004 0.008)   // 33
    (0.052 -0.004 0.008)   // 34
    (0.308 -0.004 0.008)   // 35
    (0 0.004 0.008)   // 36
    (0.052 0.004 0.008)   // 37
    (0.308 0.004 0.008)   // 38
    (0 0.0044 0.008)   // 39
    (0.052 0.0044 0.008)   // 40
    (0.308 0.0044 0.008)   // 41
    (0 0.016 0.008)   // 42
    (0.052 0.016 0.008)   // 43
    (0.308 0.016 0.008)   // 44
    (0 0.08 0.008)   // 45
    (0.052 0.08 0.008)   // 46
    (0.308 0.08 0.008)   // 47
);

blocks
(
    hex (0 1 4 3 24 25 28 27)   (104 64 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x coflowCoarseBottom (delta_coarse)
    hex (3 4 7 6 27 28 31 30)   (104 23 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x coflowRefinedBottom (delta_fine)
    hex (6 7 10 9 30 31 34 33)   (104 1 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x lipBottom (0.4mm, 1 cell)
    hex (9 10 13 12 33 34 37 36)   (104 16 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x jet (delta_fine)
    hex (12 13 16 15 36 37 40 39)   (104 1 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x lipTop (0.4mm, 1 cell)
    hex (15 16 19 18 39 40 43 42)   (104 23 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x coflowRefinedTop (delta_fine)
    hex (18 19 22 21 42 43 46 45)   (104 64 16)   simpleGrading (1 1 1)   // x refined [0,52mm] x coflowCoarseTop (delta_coarse)
    hex (1 2 5 4 25 26 29 28)   (256 64 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x coflowCoarseBottom (delta_coarse)
    hex (4 5 8 7 28 29 32 31)   (256 23 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x coflowRefinedBottom (delta_fine)
    hex (7 8 11 10 31 32 35 34)   (256 1 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x lipBottom (0.4mm, 1 cell)
    hex (10 11 14 13 34 35 38 37)   (256 16 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x jet (delta_fine)
    hex (13 14 17 16 37 38 41 40)   (256 1 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x lipTop (0.4mm, 1 cell)
    hex (16 17 20 19 40 41 44 43)   (256 23 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x coflowRefinedTop (delta_fine)
    hex (19 20 23 22 43 44 47 46)   (256 64 16)   simpleGrading (1 1 1)   // x coarse [52,308mm] x coflowCoarseTop (delta_coarse)
);

edges
(
);

boundary
(
    jetInlet
    {
        type patch;
        faces
        (
            (9 33 36 12)
        );
    }

    lipWallBottom
    {
        type wall;
        faces
        (
            (6 30 33 9)
        );
    }

    coflowInletBottom
    {
        type patch;
        faces
        (
            (0 24 27 3)
            (3 27 30 6)
        );
    }

    lipWallTop
    {
        type wall;
        faces
        (
            (12 36 39 15)
        );
    }

    coflowInletTop
    {
        type patch;
        faces
        (
            (15 39 42 18)
            (18 42 45 21)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 5 29 26)
            (5 8 32 29)
            (8 11 35 32)
            (11 14 38 35)
            (14 17 41 38)
            (17 20 44 41)
            (20 23 47 44)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (21 45 46 22)
            (22 46 47 23)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (24 25 28 27)
            (27 28 31 30)
            (30 31 34 33)
            (33 34 37 36)
            (36 37 40 39)
            (39 40 43 42)
            (42 43 46 45)
            (25 26 29 28)
            (28 29 32 31)
            (31 32 35 34)
            (34 35 38 37)
            (37 38 41 40)
            (40 41 44 43)
            (43 44 47 46)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 3 4 1)
            (3 6 7 4)
            (6 9 10 7)
            (9 12 13 10)
            (12 15 16 13)
            (15 18 19 16)
            (18 21 22 19)
            (1 4 5 2)
            (4 7 8 5)
            (7 10 11 8)
            (10 13 14 11)
            (13 16 17 14)
            (16 19 20 17)
            (19 22 23 20)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //