test/Malle/FSD/noTHM/constant/FSD/FSD_H2_flameletTable
/* Cantera flamelet continuation table extracted from analyse9.1.log.
   K       : imposed global strain rate Uin/D [1/s]
   omega0  : H2 consumption speed per unit flame area [kg/m2/s]

   50 actual continuation points are listed below.
   The separate K=3000 interpolated report value is intentionally NOT included
   because it is not a Cantera continuation point.
*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      FSD_H2_flameletTable;
}

// K [1/s]   omega0_H2 [kg/m2/s]
table
(
    (177.285279 0.00703596492)
    (194.5626 0.007153285)
    (213.2056 0.007243307)
    (233.325 0.007320241)
    (254.041 0.007347507)
    (278.8729 0.007479346)
    (304.9832 0.007550176)
    (332.3894 0.007569213)
    (365.1917 0.007742633)
    (399.5591 0.007827507)
    (437.5278 0.007920013)
    (479.2661 0.00802366)
    (524.885 0.008107761)
    (575.2999 0.008206784)
    (630.6946 0.008307732)
    (691.4882 0.00841246)
    (758.4395 0.008527971)
    (832.2738 0.008663258)
    (913.2547 0.008788166)
    (1002.275 0.008931432)
    (1100.077 0.009079105)
    (1207.386 0.009202199)
    (1325.583 0.009355323)
    (1455.768 0.009509652)
    (1598.609 0.009654324)
    (1756.061 0.009826209)
    (1929.657 0.01000099)
    (2120.704 0.01019004)
    (2330.773 0.01039025)
    (2561.643 0.01061835)
    (2815.188 0.01083023)
    (3094.007 0.01106244)
    (3400.612 0.01131103)
    (3737.93 0.01156943)
    (4108.984 0.0118381)
    (8643.683 0.01209817)
    (9626.839 0.01235627)
    (10488.46 0.01264768)
    (11424.23 0.01293433)
    (12427.53 0.01323566)
    (13525.63 0.01352475)
    (14678.03 0.01380608)
    (15905.53 0.01409804)
    (17232.52 0.01441078)
    (19416.59 0.01453338)
    (21083.76 0.01472221)
    (22856.48 0.01480471)
    (24612.67 0.01458367)
    (24946.23 0.01442816)
    (25221.05 0.01413812)
);
