test/Malle/FSD/noTHM/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
combustionModel  FSD;
active           true;

FSDCoeffs
{
    // H2 is the fuel used by the single-step FSD source construction.
    fuel        H2;

    semiImplicit false;

    // Existing FSD model parameters.
    Cv          0.1;
    ftVarMin    1e-4;

    deltaL      4.7497534e-4;
    Ncell       6.0;
    Cs          16.0;
    Fmax        10.0;

     // Colin et al. (2000) thickened-flame efficiency
    //EColin      1.44;
    EColin      1.;

    TFM false;

    // Direct lookup of the Cantera flamelet omega(K) table.
    reactionRateFlameArea  flameletTableCSV;

    flameletTableCSVCoeffs
    {
        tableFile       "H2_FSD_V11_flamelet.csv";

        KColumn         "K";
        omegaColumn     "omega0_H2";

        omegaMin        0.0;

        belowMin        clamp;
        aboveMax       clamp;
    }
}

// ************************************************************************* //
