test/Malle/FSD/noTHM/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// Selects exactly the 52 x 32 mm inlet window (full z-depth) for refinement.
// H=8mm jet + 12mm coflow each side => |y|<16mm, matches the earlier spec.
// derived y-coordinates (bottom to top)
//y0      -0.08;
//y1      -0.004;
//y2      0.004;
//yTop    0.08;
//zb      -0.008;
//zf      0.008;
actions
(
    {
        name    inletBlock;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 -0.004 -0.008) (0.30 0.004 0.008);
        }
    }
    {
        name    bottomCoflowBlock;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 -0.08 -0.008) (0.30 -0.004 0.008);
        }
    }
    {
        name    topCoflowBlock;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 -0.08 0.004) (0.30 0.08 0.008);
        }
    }

    // ------------------------------------------------------------
    // Convert cellSets to cellZones
    // ------------------------------------------------------------
    {
        name    inletZone;
        type    cellZoneSet;
        action  new;

        source  setToCellZone;

        sourceInfo
        {
            set inletBlock;
        }
    }

    {
        name    bottomCoflowZone;
        type    cellZoneSet;
        action  new;

        source  setToCellZone;

        sourceInfo
        {
            set bottomCoflowBlock;
        }
    }

    {
        name    topCoflowZone;
        type    cellZoneSet;
        action  new;

        source  setToCellZone;

        sourceInfo
        {
            set topCoflowBlock;
        }
    }

);

// ************************************************************************* //
